title: Azure Fileshare Modified or Deleted
id: 1379553c-0030-4560-97c6-b76f1e261137
description: Identifies when a fileshare is modified or deleted.
author: Austin Songer
status: experimental
date: 2021/08/16
references:
    - https://docs.microsoft.com/en-us/azure/role-based-access-control/resource-provider-operations
logsource:
  service: azure.activitylogs
detection:
    selection:
        properties.message: 
            - MICROSOFT.STORAGE/STORAGEACCOUNTS/FILESERVICES/SHARES/DELETE
            - MICROSOFT.STORAGE/STORAGEACCOUNTS/FILESERVICES/SHARES/WRITE
    condition: selection
level: medium
tags:
    - attack.impact
falsepositives:
 - Fileshare being modified or deleted may be performed by a system administrator. 
 - Verify whether the user identity, user agent, and/or hostname should be making changes in your environment. 
 - Fileshare modified or deleted from unfamiliar users should be investigated. If known behavior is causing false positives, it can be exempted from the rule.
